import type {HelpMomArticle} from "~/types";

const helpMomArticles: HelpMomArticle[] = [
	{
		id: 1,
		cover: './img/help-mom-articles/article-1-cover.jpg',
		title: 'Выбор роддома',
		slug: 'vybor-roddoma',
		description: '<p><b>Выбор роддома</b> — задача важная, решение которой зависит от многих составляющих: состояния здоровья и индивидуальных особенностей организма будущей мамочки, грамотного врача, внимательного персонала, рекомендаций знакомых и даже близости к дому.</p>',
	},
	{
		id: 2,
		cover: './img/help-mom-articles/article-2-cover.jpg',
		title: 'Знакомство с новорожденным',
		slug: 'znakomstvo-s-novorozdennym',
		description: '<p>Первая встреча мамы и новорожденного малыша очень важна, так как именно она запускает в материнском организме выработку гормонов, отвечающих за начало лактации — пролактина и окситоцина.</p>',
	},
	{
		id: 3,
		cover: './img/help-mom-articles/article-3-cover.jpg',
		title: 'Грудное вскармливание',
		slug: 'grudnoe-vskarmlivanie',
		description: '<p><b>Кормление ребёнка грудным молоком</b> — это залог крепкого здоровья малыша. Раньше грудное молоко было единственным возможным питанием для новорожденного. И сегодня, если маме не удается с первой попытки наладить кормление грудью, или кажется, что её малышу не хватает грудного молока, которое есть у нее, не стоит спешить пользоваться смесями.</p>',
	},
	{
		id: 4,
		cover: './img/help-mom-articles/article-4-cover.jpg',
		title: 'Преимущества грудного вскармливания',
		slug: 'preimuschestva-grudnogo-vskarmlivaniya',
		description: '<p><b>Главная ценность грудного молока заключается в том, что его состав подстраивается под потребности малыша в течение всего периода грудного вскармливания.</b></p><p>Выделяют несколько видов молока в зависимости от возраста малыша — молозиво (1 - 4 дня), переходное молоко (4 дня - 3 недели), зрелое молоко (3 недели - до конца лактации).</p>',
	},
	{
		id: 5,
		cover: './img/help-mom-articles/article-5-cover.jpg',
		title: 'Питание кормящей мамы',
		slug: 'pitanie-kormyashchej-mamy',
		description: '<p><b>Несмотря на то, что кормление — процесс естественный, к нему надо подготовиться.</b></p><p>Это не сложно, главное в этом деле — прислушиваться к вашему малышу и своему собственному организму, а также следовать рекомендациям специалистов.<br>Главное, о чём нужно позаботиться уже сейчас, это ваше питание. </p>',
	},
	{
		id: 6,
		cover: './img/help-mom-articles/article-6-cover.jpg',
		title: 'Забота о груди',
		slug: 'zabota-o-grudi',
		description: '<p><b>В период лактации груди необходим правильный уход — в это время повышается чувствительность сосков, возможны болезненные ощущения и изменение внешнего вида молочных желез.</b></p><p>Чтобы минимизировать возможные сложности и нежеланные последствия кормления, нужно начать заботиться о груди еще до родов и продолжать заботу весь период грудного вскармливания. </p>',
	},
	{
		id: 7,
		cover: './img/help-mom-articles/article-7-cover.jpg',
		title: 'Подбор воронки правильного размера',
		slug: 'podbor-voronki-pravilnogo-razmera',
		description: '<p>Почему очень важно грамотно подобрать воронку? Потому что именно от этого зависит, насколько правильным, продуктивным и максимально комфортным будет процесс сцеживания для мамочки.</p>',
	},
	{
		id: 9,
		cover: './img/help-mom-articles/article-9-cover.jpg',
		title: 'Хранение и разморозка грудного молока',
		slug: 'hranenie-i-razmorozka-grudnogo-moloka',
		description: '<p>Запасы молока рекомендуется создавать тогда, когда у мамы его вырабатывается большое количество. Сцеживайте молоко в разные контейнеры порционно, столько, сколько сможет съесть малыш за одно кормление.</p>',
	},
	{
		id: 11,
		cover: './img/webinar.jpg',
		title: 'Вебинар «Секреты эффективного сцеживания»',
		slug: 'vebinar-sekrety-effektivnogo-scezhivaniya',
		description: '<ol><li>1. Техника ручного сцеживания.</li><li>2. Техника сцеживания молокоотсосом.</li><li>3. Классификация молокоотсосов.</li><li>4. Однофазные и двухфазные молокоотсосы.</li></ol>',
	}
]

export default helpMomArticles;